/*判断能够构成三角形，并判断形状。

从键盘输入三个数，作为一个三角形的三条边的边长，判断构成的三角形的形状。

 如果不能构成三角形，输出“不能构成三角形”；

 如果可以构成三角形，如果能构成等腰三角形，输出“等腰三角形”；如果能构成等边三角形，输出“等边三角形”；如果能构成直角三角形，输出“直角三角形”；如果不属于以上三种形状，输出“一般三角形”。*/
 #include<stdio.h>
 int main()
 {int a,b,c;
    scanf("%d%d%d",&a,&b,&c);
    if(a+b>c&&a+c>b&&b+c>a)
    {
    if(a==b&&b==c)
    printf("等边三角形");
        
       else if(a==b||a==c||b==c)
        printf("等腰三角形");
    
    else if(a^2+b^2==c^2||a^2+c^2==b^2||b^2+c^2==a^2)
    printf("直角三角形");
    else
    printf("一般三角形");
    }
else
printf("不能构成三角形");
return 0;
 }